puts "じゃんけん・・・"

#相手が出してくるじゃんけん
zyan = ["ぐー","ちょき","ぱー"]

#じゃんけんループの定義　あいこでループ
x = 0
while x == 0 do
    puts "0（ぐー）1(ちょき）2（ぱー）3（闘わない）"

    num = $stdin.gets.to_i
    puts "ホイ！"
    puts "------------------------------------------"

#自分が0(ぐー)の場合
if num==0
  puts "ぐーを出しました"
  #相手の出す手をランダムにする
  zyan.sample
   case zyan.sample
   when "ぐー"
    puts "相手はぐーを出しました"
    puts "あいこで"
    puts "------------------------------------------"

   when "ちょき"
    puts "相手はちょきを出しました"
    puts "あなたは勝ちました"
    puts "------------------------------------------"

                            #攻め側のあっちむいてほい
                             puts "あっちむいて" 

                            #相手のあっちむいてほいの方向
                            hoi = ["上","下","右","左"]
                            n = 0

                            while n==0 do

                                puts "0（上）1(下）2（右）3（左）"
                                ati = $stdin.gets.to_i
                                puts "ホイ！"
                                puts "------------------------------------------"

                            #自分が上を指した場合
                            if ati==0
                                puts "上を指しました"
                                #相手が向く方向をランダムにする
                                hoi.sample
                                case hoi.sample
                                when "上"
                                    puts "相手は上を向きました"
                                    puts "あなたは勝ちました"
                                    return

                                when "下"
                                    puts "相手は下を向きました"
                                    puts "じゃんけん"
                                    puts "------------------------------------------"
                                    break

                                when "右"
                                    puts "相手は右を向きました"
                                    puts "じゃんけん"
                                    puts "------------------------------------------"
                                    break

                                when "左"
                                    puts "相手は左を向きました"
                                    puts "じゃんけん"
                                    puts "------------------------------------------"
                                    break

                                end

                            #自分が下を指した場合
                            elsif ati==1
                                puts "下を指しました"
                                #相手が向く方向をランダムにする
                                hoi.sample
                                case hoi.sample
                                when "上"
                                    puts "相手は上を向きました"
                                    puts "じゃんけん"
                                    puts "------------------------------------------"
                                    break

                                when "下"
                                    puts "相手は下を向きました"
                                    puts "あなたは勝ちました"
                                    return

                                when "右"
                                    puts "相手は右を向きました"
                                    puts "じゃんけん"
                                    puts "------------------------------------------"
                                    break

                                when "左"
                                    puts "相手は左を向きました"
                                    puts "じゃんけん"
                                    puts "------------------------------------------"
                                    break

                                end

                            #自分が右を指した場合
                            elsif ati==2
                                puts "右を指しました"
                                #相手が向く方向をランダムにする
                                hoi.sample
                                case hoi.sample
                                when "上"
                                    puts "相手は上を向きました"
                                    puts "じゃんけん"
                                    puts "------------------------------------------"
                                    break

                                when "下"
                                    puts "相手は下を向きました"
                                    puts "じゃんけん"
                                    puts "------------------------------------------"
                                    break

                                when "右"
                                    puts "相手は右を向きました"
                                    puts "あなたは勝ちました"
                                    return

                                when "左"
                                    puts "相手は左を向きました"
                                    puts "じゃんけん"
                                    puts "------------------------------------------"
                                    break

                                end

                            #自分が左を指した場合
                            elsif ati==3
                                puts "左を指しました"
                                #相手が向く方向をランダムにする
                                hoi.sample
                                case hoi.sample
                                when "上"
                                    puts "相手は上を向きました"
                                    puts "じゃんけん"
                                    puts "------------------------------------------"
                                    break

                                when "下"
                                    puts "相手は下を向きました"
                                    puts "じゃんけん"
                                    puts "------------------------------------------"
                                    break

                                when "右"
                                    puts "相手は右を向きました"
                                    puts "じゃんけん"
                                    puts "------------------------------------------"
                                    break

                                when "左"
                                    puts "相手は左を向きました"
                                    puts "あなたは勝ちました"
                                    return
                                end
                            else
                                puts "無効試合です"
                                puts "------------------------------------------"
                                break
                            end
                            end

    

   when "ぱー"
    puts "相手はぱーを出しました"
    puts "あなたは負けました"
    puts "------------------------------------------"
                                #守り側のあっちむいてほい
                                puts "あっちむいて" 

                                #相手のあっちむいてほいの方向
                                hoi = ["上","下","右","左"]
                                n = 0

                                while n==0 do

                                    puts "0（上）1(下）2（右）3（左）"
                                    ati = $stdin.gets.to_i
                                    puts "ホイ！"
                                    puts "------------------------------------------"

                                #自分が上を向いた場合
                                if ati==0
                                    puts "上を向きました"
                                    #相手が向く方向をランダムにする
                                    hoi.sample
                                    case hoi.sample
                                    when "上"
                                        puts "相手は上を指しました"
                                        puts "あなたは負けました"
                                        return

                                    when "下"
                                        puts "相手は下を指しました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break

                                    when "右"
                                        puts "相手は右を指しました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break

                                    when "左"
                                        puts "相手は左を指しました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break

                                    end

                                #自分が下を向いた場合
                                elsif ati==1
                                    puts "下を向きました"
                                    #相手が向く方向をランダムにする
                                    hoi.sample
                                    case hoi.sample
                                    when "上"
                                        puts "相手は上を指しました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break

                                    when "下"
                                        puts "相手は下を指しました"
                                        puts "あなたは負けました"
                                        return

                                    when "右"
                                        puts "相手は右を指しました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break

                                    when "左"
                                        puts "相手は左を指しました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break

                                    end

                                #自分が右を向いた場合
                                elsif ati==2
                                    puts "右を向きました"
                                    #相手が向く方向をランダムにする
                                    hoi.sample
                                    case hoi.sample
                                    when "上"
                                        puts "相手は上を指しました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break

                                    when "下"
                                        puts "相手は下を指しました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break

                                    when "右"
                                        puts "相手は右を指しました"
                                        puts "あなたは負けました"
                                        return

                                    when "左"
                                        puts "相手は左を指しました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break

                                    end

                                #自分が左を向いた場合
                                elsif ati==3
                                    puts "左を向きました"
                                    #相手が向く方向をランダムにする
                                    hoi.sample
                                    case hoi.sample
                                    when "上"
                                        puts "相手は上を指しました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break

                                    when "下"
                                        puts "相手は下を指しました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break

                                    when "右"
                                        puts "相手は右を指しました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break

                                    when "左"
                                        puts "相手は左を指しました"
                                        puts "あなたは負けました"
                                        return
                                    end
                                else
                                    puts "無効試合です"
                                    puts "------------------------------------------"
                                    break
                                end
                                end
    

   end
  
 #自分が1(ちょき)の場合
elsif num==1
  puts "ちょきを出しました"
  zyan.sample
   case zyan.sample
   when "ぐー"
    puts "相手はぐーを出しました"
    puts "あなたは負けました"
    puts "------------------------------------------"
                                #守り側のあっちむいてほい
                                puts "あっちむいて" 

                                #相手のあっちむいてほいの方向
                                hoi = ["上","下","右","左"]
                                n = 0

                                while n==0 do

                                    puts "0（上）1(下）2（右）3（左）"
                                    ati = $stdin.gets.to_i
                                    puts "ホイ！"
                                    puts "------------------------------------------"

                                #自分が上を向いた場合
                                if ati==0
                                    puts "上を向きました"
                                    #相手が向く方向をランダムにする
                                    hoi.sample
                                    case hoi.sample
                                    when "上"
                                        puts "相手は上を指しました"
                                        puts "あなたは負けました"
                                        return

                                    when "下"
                                        puts "相手は下を指しました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break

                                    when "右"
                                        puts "相手は右を指しました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break

                                    when "左"
                                        puts "相手は左を指しました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break

                                    end

                                #自分が下を向いた場合
                                elsif ati==1
                                    puts "下を向きました"
                                    #相手が向く方向をランダムにする
                                    hoi.sample
                                    case hoi.sample
                                    when "上"
                                        puts "相手は上を指しました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break

                                    when "下"
                                        puts "相手は下を指しました"
                                        puts "あなたは負けました"
                                        return

                                    when "右"
                                        puts "相手は右を指しました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break

                                    when "左"
                                        puts "相手は左を指しました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break

                                    end

                                #自分が右を向いた場合
                                elsif ati==2
                                    puts "右を向きました"
                                    #相手が向く方向をランダムにする
                                    hoi.sample
                                    case hoi.sample
                                    when "上"
                                        puts "相手は上を指しました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break

                                    when "下"
                                        puts "相手は下を指しました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break

                                    when "右"
                                        puts "相手は右を指しました"
                                        puts "あなたは負けました"
                                        return

                                    when "左"
                                        puts "相手は左を指しました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break

                                    end

                                #自分が左を向いた場合
                                elsif ati==3
                                    puts "左を向きました"
                                    #相手が向く方向をランダムにする
                                    hoi.sample
                                    case hoi.sample
                                    when "上"
                                        puts "相手は上を指しました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break

                                    when "下"
                                        puts "相手は下を指しました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break

                                    when "右"
                                        puts "相手は右を指しました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break

                                    when "左"
                                        puts "相手は左を指しました"
                                        puts "あなたは負けました"
                                        return
                                    end
                                else
                                    puts "無効試合です"
                                    puts "------------------------------------------"
                                    break
                                end
                                end
    

   when "ちょき"
    puts "相手はちょきを出しました"
    puts "あいこで"
    puts "------------------------------------------"

   when "ぱー"
    puts "相手はぱーを出しました"
    puts "あなたは勝ちました"
    puts "------------------------------------------"
                                #攻め側のあっちむいてほい
                                puts "あっちむいて" 

                                #相手のあっちむいてほいの方向
                                hoi = ["上","下","右","左"]
                                n = 0
    
                                while n==0 do
    
                                    puts "0（上）1(下）2（右）3（左）"
                                    ati = $stdin.gets.to_i
                                    puts "ホイ！"
                                    puts "------------------------------------------"
    
                                #自分が上を指した場合
                                if ati==0
                                    puts "上を指しました"
                                    #相手が向く方向をランダムにする
                                    hoi.sample
                                    case hoi.sample
                                    when "上"
                                        puts "相手は上を向きました"
                                        puts "あなたは勝ちました"
                                        return
    
                                    when "下"
                                        puts "相手は下を向きました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break
    
                                    when "右"
                                        puts "相手は右を向きました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break
    
                                    when "左"
                                        puts "相手は左を向きました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break
    
                                    end
    
                                #自分が下を指した場合
                                elsif ati==1
                                    puts "下を指しました"
                                    #相手が向く方向をランダムにする
                                    hoi.sample
                                    case hoi.sample
                                    when "上"
                                        puts "相手は上を向きました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break
    
                                    when "下"
                                        puts "相手は下を向きました"
                                        puts "あなたは勝ちました"
                                        return
    
                                    when "右"
                                        puts "相手は右を向きました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break
    
                                    when "左"
                                        puts "相手は左を向きました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break
    
                                    end
    
                                #自分が右を指した場合
                                elsif ati==2
                                    puts "右を指しました"
                                    #相手が向く方向をランダムにする
                                    hoi.sample
                                    case hoi.sample
                                    when "上"
                                        puts "相手は上を向きました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break
    
                                    when "下"
                                        puts "相手は下を向きました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break
    
                                    when "右"
                                        puts "相手は右を向きました"
                                        puts "あなたは勝ちました"
                                        return
    
                                    when "左"
                                        puts "相手は左を向きました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break
    
                                    end
    
                                #自分が左を指した場合
                                elsif ati==3
                                    puts "左を指しました"
                                    #相手が向く方向をランダムにする
                                    hoi.sample
                                    case hoi.sample
                                    when "上"
                                        puts "相手は上を向きました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break
    
                                    when "下"
                                        puts "相手は下を向きました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break
    
                                    when "右"
                                        puts "相手は右を向きました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break
    
                                    when "左"
                                        puts "相手は左を向きました"
                                        puts "あなたは勝ちました"
                                        return
                                    end
                                else
                                    puts "無効試合です"
                                    puts "------------------------------------------"
                                    break
                                end
                                end
    

   end
  
 #自分が2(ぱー)の場合
elsif num==2
  puts "ぱーを出しました"
  zyan.sample
   case zyan.sample
   when "ぐー"
    puts "相手はぐーを出しました"
    puts "あなたは勝ちました"
    puts "------------------------------------------"
                                #攻め側のあっちむいてほい
                                puts "あっちむいて" 

                                #相手のあっちむいてほいの方向
                                hoi = ["上","下","右","左"]
                                n = 0
    
                                while n==0 do
    
                                    puts "0（上）1(下）2（右）3（左）"
                                    ati = $stdin.gets.to_i
                                    puts "ホイ！"
                                    puts "------------------------------------------"
    
                                #自分が上を指した場合
                                if ati==0
                                    puts "上を指しました"
                                    #相手が向く方向をランダムにする
                                    hoi.sample
                                    case hoi.sample
                                    when "上"
                                        puts "相手は上を向きました"
                                        puts "あなたは勝ちました"
                                        return
    
                                    when "下"
                                        puts "相手は下を向きました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break
    
                                    when "右"
                                        puts "相手は右を向きました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break
    
                                    when "左"
                                        puts "相手は左を向きました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break
    
                                    end
    
                                #自分が下を指した場合
                                elsif ati==1
                                    puts "下を指しました"
                                    #相手が向く方向をランダムにする
                                    hoi.sample
                                    case hoi.sample
                                    when "上"
                                        puts "相手は上を向きました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break
    
                                    when "下"
                                        puts "相手は下を向きました"
                                        puts "あなたは勝ちました"
                                        return
    
                                    when "右"
                                        puts "相手は右を向きました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break
    
                                    when "左"
                                        puts "相手は左を向きました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break
    
                                    end
    
                                #自分が右を指した場合
                                elsif ati==2
                                    puts "右を指しました"
                                    #相手が向く方向をランダムにする
                                    hoi.sample
                                    case hoi.sample
                                    when "上"
                                        puts "相手は上を向きました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break
    
                                    when "下"
                                        puts "相手は下を向きました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break
    
                                    when "右"
                                        puts "相手は右を向きました"
                                        puts "あなたは勝ちました"
                                        return
    
                                    when "左"
                                        puts "相手は左を向きました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break
    
                                    end
    
                                #自分が左を指した場合
                                elsif ati==3
                                    puts "左を指しました"
                                    #相手が向く方向をランダムにする
                                    hoi.sample
                                    case hoi.sample
                                    when "上"
                                        puts "相手は上を向きました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break
    
                                    when "下"
                                        puts "相手は下を向きました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break
    
                                    when "右"
                                        puts "相手は右を向きました"
                                        puts "じゃんけん"
                                        puts "------------------------------------------"
                                        break
    
                                    when "左"
                                        puts "相手は左を向きました"
                                        puts "あなたは勝ちました"
                                        return
                                    end
                                else
                                    puts "無効試合です"
                                    puts "------------------------------------------"
                                    break
                                end
                                end
    

   when "ちょき"
    puts "相手はちょきを出しました"
    puts "あなたは負けました"
    puts "------------------------------------------"
                                    #守り側のあっちむいてほい
                                    puts "あっちむいて" 

                                    #相手のあっちむいてほいの方向
                                    hoi = ["上","下","右","左"]
                                    n = 0

                                    while n==0 do

                                        puts "0（上）1(下）2（右）3（左）"
                                        ati = $stdin.gets.to_i
                                        puts "ホイ！"
                                        puts "------------------------------------------"

                                    #自分が上を向いた場合
                                    if ati==0
                                        puts "上を向きました"
                                        #相手が向く方向をランダムにする
                                        hoi.sample
                                        case hoi.sample
                                        when "上"
                                            puts "相手は上を指しました"
                                            puts "あなたは負けました"
                                            return

                                        when "下"
                                            puts "相手は下を指しました"
                                            puts "じゃんけん"
                                            puts "------------------------------------------"
                                            break

                                        when "右"
                                            puts "相手は右を指しました"
                                            puts "じゃんけん"
                                            puts "------------------------------------------"
                                            break

                                        when "左"
                                            puts "相手は左を指しました"
                                            puts "じゃんけん"
                                            puts "------------------------------------------"
                                            break

                                        end

                                    #自分が下を向いた場合
                                    elsif ati==1
                                        puts "下を向きました"
                                        #相手が向く方向をランダムにする
                                        hoi.sample
                                        case hoi.sample
                                        when "上"
                                            puts "相手は上を指しました"
                                            puts "じゃんけん"
                                            puts "------------------------------------------"
                                            break

                                        when "下"
                                            puts "相手は下を指しました"
                                            puts "あなたは負けました"
                                            return

                                        when "右"
                                            puts "相手は右を指しました"
                                            puts "じゃんけん"
                                            puts "------------------------------------------"
                                            break

                                        when "左"
                                            puts "相手は左を指しました"
                                            puts "じゃんけん"
                                            puts "------------------------------------------"
                                            break

                                        end

                                    #自分が右を向いた場合
                                    elsif ati==2
                                        puts "右を向きました"
                                        #相手が向く方向をランダムにする
                                        hoi.sample
                                        case hoi.sample
                                        when "上"
                                            puts "相手は上を指しました"
                                            puts "じゃんけん"
                                            puts "------------------------------------------"
                                            break

                                        when "下"
                                            puts "相手は下を指しました"
                                            puts "じゃんけん"
                                            puts "------------------------------------------"
                                            break

                                        when "右"
                                            puts "相手は右を指しました"
                                            puts "あなたは負けました"
                                            return

                                        when "左"
                                            puts "相手は左を指しました"
                                            puts "じゃんけん"
                                            puts "------------------------------------------"
                                            break

                                        end

                                    #自分が左を向いた場合
                                    elsif ati==3
                                        puts "左を向きました"
                                        #相手が向く方向をランダムにする
                                        hoi.sample
                                        case hoi.sample
                                        when "上"
                                            puts "相手は上を指しました"
                                            puts "じゃんけん"
                                            puts "------------------------------------------"
                                            break

                                        when "下"
                                            puts "相手は下を指しました"
                                            puts "じゃんけん"
                                            puts "------------------------------------------"
                                            break

                                        when "右"
                                            puts "相手は右を指しました"
                                            puts "じゃんけん"
                                            puts "------------------------------------------"
                                            break

                                        when "左"
                                            puts "相手は左を指しました"
                                            puts "あなたは負けました"
                                            return
                                        end
                                    else
                                        puts "無効試合です"
                                        puts "------------------------------------------"
                                        break
                                    end
                                    end
    

   when "ぱー"
    puts "相手はぱーを出しました"
    puts "あいこで"
    puts "------------------------------------------"

   end
  
 #自分が3(闘わない)の場合
else
    puts "無効試合です"
    puts "------------------------------------------"
end
end

